In [12]:
import pandas as pd

In [13]:
df=pd.read_excel("Data Analysis.xlsx")
df

      Invoice ID Branch  ... gross income Rating
0    860-79-0874      C  ...      49.6500    6.6
1    226-31-3081      C  ...       3.8200    9.6
2    631-41-3108      A  ...      16.2155    7.4
3    687-47-8271      A  ...      49.4900    8.7
4    283-26-5248      C  ...      49.2600    4.5
..           ...    ...  ...          ...    ...
995  236-86-3015      C  ...       0.6990    9.8
996  192-98-7397      C  ...       0.6390    9.5
997  279-62-1445      C  ...       0.6270    8.2
998  308-39-1707      A  ...       0.6045    8.2
999  784-21-9238      C  ...       0.5085    5.9

[1000 rows x 18 columns]

1 Perform basic analysis and comment on
      Shape
     Dtype  
     Check for missing values and its treatment

In [14]:
df.shape

(1000, 18)

In [ ]:
df.info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 18 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Invoice ID               1000 non-null   object
 1   Branch                   1000 non-null   object
 2   City                     1000 non-null   object
 3   Customer type            1000 non-null   object
 4   Gender                   1000 non-null   object
 5   Product line             1000 non-null   object
 6   Unit price               1000 non-null   float64
 7   Quantity                 1000 non-null   int64
 8   Tax 5%                   1000 non-null   float64
 9   Total                    1000 non-null   float64
 10  Day                      1000 non-null   int64
 11  Date                     1000 non-null   datetime64[ns]
 12  Time                     1000 non-null   object
 13  Payment                  1000 non-null   object
 14  cogs                     1000 non-null   float64
 15  gross margin percentage  1000 non-null   float64
 16  gross income             1000 non-null   float64
 17  Rating                   1000 non-null   float64
dtypes: datetime64[ns](1), float64(7), int64(2), object(8)
memory usage: 140.8+ KB

In [ ]:
df.notnull()

     Invoice ID  Branch  City  ...  gross margin percentage  gross income  Rating
0          True    True  True  ...                     True          True    True
1          True    True  True  ...                     True          True    True
2          True    True  True  ...                     True          True    True
3          True    True  True  ...                     True          True    True
4          True    True  True  ...                     True          True    True
..          ...     ...   ...  ...                      ...           ...     ...
995        True    True  True  ...                     True          True    True
996        True    True  True  ...                     True          True    True
997        True    True  True  ...                     True          True    True
998        True    True  True  ...                     True          True    True
999        True    True  True  ...                     True          True    True

[1000 rows x 18 columns]

2 Customer type                      
      Gender
      Product Line
      Day (1=Sunday, 2=Monday and so on)
      Payment

In [ ]:
print("total count in branch: ",df['Branch'].value_counts().sum())
print("individual count in branch: ",df['Branch'].value_counts())

total count in branch:  1000
individual count in branch:  A    340
B    332
C    328
Name: Branch, dtype: int64

In [ ]:
print("total count in City: ",df['City'].value_counts().sum())
print("individual count in City: ",df['City'].value_counts())

total count in City:  1000
individual count in City:  Yangon       340
Mandalay     332
Naypyitaw    328
Name: City, dtype: int64

In [ ]:
print("total count in Customer type: ",df['Customer type'].value_counts().sum())
print("individual count in Customer type: ",df['Customer type'].value_counts())

total count in Customer type:  1000
individual count in Customer type:  Member    501
Normal    499
Name: Customer type, dtype: int64

In [ ]:
print("total count in Gender: ",df['Gender'].value_counts().sum())
print("individual count in Gender: ",df['Gender'].value_counts())

total count in Gender:  1000
individual count in Gender:  Female    501
Male      499
Name: Gender, dtype: int64

In [ ]:
print("total count in Product line: ",df['Product line'].value_counts().sum())
print("individual count in Product Line: ",df['Product line'].value_counts())

total count in Product line:  1000
individual count in Product Line:  Fashion accessories       178
Food and beverages        174
Electronic accessories    170
Sports and travel         166
Home and lifestyle        160
Health and beauty         152
Name: Product line, dtype: int64

In [ ]:
print("total count in Payment	: ",df['Payment'].value_counts().sum())
print("individual count in Payment: ",df['Payment'].value_counts())

total count in Payment	:  1000
individual count in Payment:  Ewallet        345
Cash           344
Credit card    311
Name: Payment, dtype: int64

In [18]:
df["Day"].replace(to_replace=[1,2,3,4,5,6,7],value=['Sunday','Monday','Tuesday','Wednesday','Thursday','Friday','Saturday'],inplace=True)

In [20]:
print("total count in Day	: ",df['Day'].value_counts().sum())
print("individual count in Day: \n ",df['Day'].value_counts())

total count in Day	:  1000
individual count in Day:
  Saturday     164
Tuesday      158
Wednesday    143
Friday       139
Thursday     138
Sunday       133
Monday       125
Name: Day, dtype: int64

In [22]:
# 4. Branch location in city
df1=df[['Branch','City']]
br=df1.groupby(['Branch','City']).sum()
br

Empty DataFrame
Columns: []
Index: [(A, Yangon), (B, Mandalay), (C, Naypyitaw)]

In [26]:
 #3. Total Sale Amount and % of contribution
print("Total Amount = ",df['Total'].sum())
print("\n% Contributed by men = ",499/1000,"%")
print("\n% Contributed by women = ",501/1000,"%")

Total Amount =  322966.74899999995

% Contributed by men =  0.499 %

% Contributed by women =  0.501 %

5 city wise sales amount.

In [23]:
df_groupby_2=df[['City','Total']]
city_sale=ds_groupby_2.groupby(by='City').sum()
city_sale

                 Total
City
Mandalay   106197.6720
Naypyitaw  110568.7065
Yangon     106200.3705


	In which city sale was maximum

In [24]:
city_sale.max()

Total    110568.7065
dtype: float64

	In which city sale was minimum

In [ ]:
df_city_sale.min()

Total    106197.672
dtype: float64

In [27]:
#6 payment method is used maximum times by Male and Female
groupby_3=df[['Gender','Payment']].value_counts()
Max_Payment=groupby_3.groupby(['Gender','Payment']).sum()
Max_Payment

Gender  Payment
Female  Cash           178
        Credit card    163
        Ewallet        160
Male    Cash           166
        Credit card    148
        Ewallet        185
dtype: int64

In [30]:
#7 	Which Day of the week saw the maximum sale?
       #Calculate sale for each Day
       
group1=df[['Day','Total']]
sale=group1.groupby(by='Day').sum()
sale

                Total
Day
Friday     43926.3405
Monday     37899.0780
Saturday   56120.8095
Sunday     44457.8925
Thursday   45349.2480
Tuesday    51482.2455
Wednesday  43731.1350

In [31]:
sale.max()

Total    56120.8095
dtype: float64

8   Tax did government collect?

       Which city paid highest
       Which city paid lowest tax

In [33]:
group_tax=df[['City','Tax 5%']]
df_tax=group_tax.groupby(by='City').sum()
print("City wise Total Tax : \n")
print(df_tax)
print('\n The Total amount of tax collected in all cities is Rs. ',df_tax.sum())

City wise Total Tax :

              Tax 5%
City
Mandalay   5057.0320
Naypyitaw  5265.1765
Yangon     5057.1605

 The Total amount of tax collected in all cities is Rs.  Tax 5%    15379.369
dtype: float64

In [ ]:
df_tax.max()

Tax 5%    5265.1765
dtype: float64

In [ ]:
df_tax.min()

Tax 5%    5057.032
dtype: float64